# Напишите программу, которая запрашивает два
# целых числа x и y, после чего вычисляет и выводит
# значение x в степени y.

num1 = int(input("Введите первое число: "))
num2 = int(input("Введите второе число: "))
print(num1 ** num2)