# Дана масса в килограммах. Найти число полных центнеров в ней

kg = int(input("Введите количество киллограммов: "))

Metrs = a*0.01

print(f"В {sm} сантиметрах {Metrs} метров")