# Дана масса в килограммах. Найти число полных центнеров в ней

kg = int(input("Введите количество киллограммов: "))

Centners = kg//100

print(f"В {kg} килограмм {Centners} центнеров")