# Дана масса в килограммах. Найти число полных тонн в ней.

kg = int(input("Введите количество киллограммов: "))

Tonn = kg//1000

print(f"В {kg} килограмм {Tonn} тонн")