# Дано расстояние в сантиметрах. Найти число полных метров в нем

sm = int(input("Введите количество сантиметров: "))

Metrs = sm * 0.01

print(f"В {sm} сантиметрах {Metrs} метров")