# Дано расстояние в метрах. Найти число полных километров в нем.

Metrs = int(input("Введите количество метров: "))

Km = Metrs//1000

print(f"В {Metrs} метрах {Km} километров")