# Дан прямоугольник с размерами 543*130 мм. Сколько квадратов со стороной
# 130 мм можно отрезать от него?

print(543//130)